public class Main {

    /* 1) На прямоугольной декартовой системе координат на плоскости заданы три
    точки с соответствующими координатами в виде пары значений (x,y).
    Определить, являются ли данные точки вершинами треугольника. И если да, то
    дополнительно определить, является ли данный треугольник прямоугольным. */

    public static boolean Vertex ()
    {

    }


    /* 2) В молодом возрасте дракон каждый год отращивает по три головы, но после
    того, как ему исполнится 200 лет – только по две, а после 300 лет – лишь по
    одной. Предполагается, что дракон появляется на свет сразу с тремя головами.
    Разработайте программу, которая высчитывала бы, сколько голов и глаз у
    дракона, которому N лет?*/

    public static int DragonHeadsCount (int age)
    {

    }

    public static int DragonEyesCount (int age)
    {
        return DragonHeadsCount(age) * 2;
    }


    /* 3) Напишите программу, которая бы определяла, является ли введённая буква
    (символ) гласной (постарайтесь сделать минимум четырьмя способами,
    разрешается и больше).*/

    public static boolean Vowel (char c)
    {

    }


    /* 4) Заданы три целых числа, которые задают некоторую дату по Грегорианскому
    календарю (https://ru.wikipedia.org/wiki/Григорианский_календарь). Определить
    дату следующего дня. Запрещается использовать типы стандартной библиотеки
    языка для работы с датой и временем. Также необходимо учесть то, что по
    григорианскому календарю (используется в настоящий момент) високосный год
    определяется следующим образом:
             годы, кратные 4 – високосные (например, 2008, 2012, 2016);
             годы, кратные 4 и 100 – невисокосные (например, 1700, 1800, 1900);
             годы, кратные 4, 100 и 400 – високосные (например, 1600, 2000, 2400).*/

    public static void main(String[] args) {

    }
}
